app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", 1]]
---
 def contactme
  @blog = Blog.find(params[:id])

SELECT "blogs".* FROM "blogs"  ORDER BY id desc
---
  def index
    @blogs = Blog.all.sorted

SELECT "blogs".* FROM "blogs"
SELECT "categories".* FROM "categories"
---
  def new
    @blog = Blog.new
    @b = Blog.all


  @categories = Category.all

INSERT INTO "blogs" ("siteTitle", "siteDescription", "siteHeader", "category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @blog = Blog.new(blog_params)

    #aqui agregamos el id del usuario logueado y lo asociamos al nuevo blog creado
    @blog.user_id   =   current_user.id

    respond_to do |format|
      if @blog.save