app/controllers/posts_controller.rb

  def create


     #asignamos al objeto pin un registro que corresponde a pin_id que estamos evaluando, en la url
  @blog =Blog.find(params[:blog_id])
  #
  @post = Post.new(post_params)

  #al comentario le asocio un pin especifico, el cargado en memoria, a esto le asigno el objeto @pin
  @post.blog = @blog

  #guardo el objeto pin llamando a su metodo .save
  @post.save
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "posts" ("entryTitle", "entryContent", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["entryTitle", "zxc"], ["entryContent", "asd"], ["blog_id", 1], ["created_at", "2015-02-13 03:56:05.684341"], ["updated_at", "2015-02-13 03:56:05.684341"]]